&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ЭтоАдресВременногоХранилища(СсылкаНаКартинку) Тогда
		
		ФайлКартинки = ПолучитьИзВременногоХранилища(СсылкаНаКартинку);
		
		ТекущийОбъект.Картинка = Новый ХранилищеЗначения(ФайлКартинки);
		
		
		УдалитьИзВременногоХранилища(СсылкаНаКартинку);
		
		СсылкаНаКартинку = ПолучитьНавигационнуюСсылку(Объект.Ссылка, "Картинка");
		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СсылкаНаКартинку = ПолучитьНавигационнуюСсылку(Объект.Ссылка, "Картинка");
	Элементы.СсылкаНаКартинку.РазмерКартинки = РазмерКартинки.АвтоРазмер;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВосстановитьЗначенияРеквизитовФормы();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	СохранитьЗначенияРеквизитовФормы();
КонецПроцедуры

#Область РаботаСКартинкой

&НаКлиенте
Процедура СсылкаНаКартинкуНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь; 
	Режим = РежимДиалогаВыбораФайла.Открытие;
	
	ДиалогОткрытия = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытия.МножественныйВыбор = Ложь;
	
	
	ДиалогОткрытия.ПолноеИмяФайла = Неопределено;	
	ДиалогОткрытия.Фильтр = "Файл Jpg (*.jpg)|*.jpg";
	
	
	ДиалогОткрытия.Заголовок = "Выберите файл для загрузки"; 
	
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗагрузкиФайла", ЭтаФорма); 
	ДиалогОткрытия.Показать(ОписаниеОповещения);
	
	
КонецПроцедуры  

&НаКлиенте
Процедура ПослеЗагрузкиФайла(ВыбранныйФайл, ДополнительныеПараметры) Экспорт 
	Если ВыбранныйФайл = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	СсылкаНаКартинку = ВыбранныйФайл[0];
     
	
	ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения("ОписаниеОповещенияОЗавершении", ЭтаФорма);
	ОписаниеОповещенияОХодеВыполнения = Новый ОписаниеОповещения("ОписаниеОповещенияОХодеВыполнения", ЭтаФорма);
	ОписаниеОповещенияПередНачалом = Новый ОписаниеОповещения("ОписаниеОповещенияПередНачалом", ЭтаФорма);
	
	НачатьПомещениеФайлаНаСервер(ОписаниеОповещенияОЗавершении, , , , СсылкаНаКартинку, УникальныйИдентификатор);
	

	
КонецПроцедуры

&НаКлиенте
Процедура ОписаниеОповещенияПередНачалом(ПомещаемыйФайл, ОтказОтПомещенияФайла, ДополнительныеПараметры) Экспорт 	
КонецПроцедуры

&НаКлиенте
Процедура ОписаниеОповещенияОХодеВыполнения(ПомещаемыйФайл, Помещено, ОтказОтПомещенияФайла, ДополнительныеПараметры) Экспорт 
КонецПроцедуры

&НаКлиенте 
Процедура ОписаниеОповещенияОЗавершении(ОписаниеПереданногоФайла, ДополнительныеПраметры) Экспорт 
	Если ПустаяСтрока(СсылкаНаКартинку) Тогда 
		 Возврат;
	 КонецЕсли; 
	 
	 СсылкаНаКартинку = ОписаниеПереданногоФайла.Адрес;
	 Модифицированность = Истина;
КонецПроцедуры


&НаКлиенте
Процедура УдалитьИзображение(Команда)
	ЭтотОбъект.СсылкаНаКартинку = Неопределено;
	УдалениеИзображения();
КонецПроцедуры 

&НаСервере
Процедура УдалениеИзображения()
	
    ОчисткаХранилища = РеквизитФормыВЗначение("Объект");
   	ОчисткаХранилища.Картинка = Новый ХранилищеЗначения(Неопределено);
    ОчисткаХранилища.Записать();
   	ЗначениеВРеквизитФормы(ОчисткаХранилища, "Объект");
  	
КонецПроцедуры


#КонецОбласти

#Область РаботаСРеквизитамиФормы

&НаСервере
Процедура СохранитьЗначенияРеквизитовФормы()
	Если Не Объект.Ссылка.Пустая() Тогда
		Настройки = Новый Соответствие;
		Настройки.Вставить("ДополнительнаяИнформация", ДополнительнаяИнформация);
		
		СерверныеПроцедуры.СохранитьЗначенияРеквизитов(Объект.Ссылка, Настройки);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ВосстановитьЗначенияРеквизитовФормы()
	ЗначенияРеквизитов = СерверныеПроцедуры.ВосстановитьЗначенияРеквизитов(Объект.Ссылка);
	
	Если ТипЗнч(ЗначенияРеквизитов) = Тип("Соответствие") Тогда
		ДополнительнаяИнформация = ЗначенияРеквизитов.Получить("ДополнительнаяИнформация");	
	КонецЕсли;
КонецПроцедуры


#КонецОбласти