
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.НачислениеЗарплаты.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НачислениеЗарплаты.Дата,
	|	НачислениеЗарплаты.Номер,
	|	НачислениеЗарплаты.ОсновныеНачисления.(
	|		НомерСтроки,
	|		Сотрудник,
	|		Подразделение,
	|		Размер
	|	)
	|ИЗ
	|	Документ.НачислениеЗарплаты КАК НачислениеЗарплаты
	|ГДЕ
	|	НачислениеЗарплаты.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьОсновныеНачисленияШапка = Макет.ПолучитьОбласть("ОсновныеНачисленияШапка");
	ОбластьОсновныеНачисления = Макет.ПолучитьОбласть("ОсновныеНачисления");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьОсновныеНачисленияШапка);
		ВыборкаОсновныеНачисления = Выборка.ОсновныеНачисления.Выбрать();
		Пока ВыборкаОсновныеНачисления.Следующий() Цикл
			ОбластьОсновныеНачисления.Параметры.Заполнить(ВыборкаОсновныеНачисления);
			ТабДок.Вывести(ОбластьОсновныеНачисления, ВыборкаОсновныеНачисления.Уровень());
		КонецЦикла;

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
