
&НаКлиенте
Процедура Получить(Команда)
	Если Не ЗначениеЗаполнено(ДатаЗагрузки) Тогда 
		Сообщить("Не выбрана дата", СтатусСообщения.Важное);
		Возврат
	КонецЕсли;
	ТаблицаКурсаВалют.Очистить();
	ЗагрузитьКурсыВалют(ДатаЗагрузки);
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьКурсыВалют(ДатаЗагрузки)
	
	Прокси = WSСсылки.DailyInfo.СоздатьWSПрокси("http://web.cbr.ru/", "DailyInfo", "DailyInfoSoap");
	
	ТипWSПараметра = Прокси.ФабрикаXDTO.Пакеты.Получить("http://web.cbr.ru/").Получить("GetCursOnDate");	
	
	WSПараметр = Прокси.ФабрикаXDTO.Создать(ТипWSПараметра);
	WSПараметр.On_Date = ДатаЗагрузки;
	
	КурсыВалют = Прокси.GetCursOnDate(WSПараметр);
	
	Для Каждого Элемент Из КурсыВалют.GetCursOnDateResult.diffgram.ValuteData.ValuteCursOnDate Цикл 
		
		НоваяСтрокаТЗ = ТаблицаКурсаВалют.Добавить();
		НоваяСтрокаТЗ.НазваниеВалюты = Элемент.Vname;
		НоваяСтрокаТЗ.Номинал = Элемент.Vnom;
		НоваяСтрокаТЗ.ЦифровойКодВалюты = Элемент.Vcode;
		НоваяСтрокаТЗ.СимвольныйКодВалюты = Элемент.VChCode;
		НоваяСтрокаТЗ.КурсВалюты = Элемент.Vcurs;
		
		
		РегистрКурсыВалют = РегистрыСведений.КурсыВалют.СоздатьМенеджерЗаписи();
	
		РегистрКурсыВалют.Период = ДатаЗагрузки;
		РегистрКурсыВалют.НазваниеВалюты = Элемент.Vname;
		РегистрКурсыВалют.Номинал = Элемент.Vnom;
		РегистрКурсыВалют.ЦифровойКодВалюты = Элемент.Vcode;
		РегистрКурсыВалют.СимвольныйКодВалюты = Элемент.VChCode;
		РегистрКурсыВалют.КурсВалюты = Элемент.Vcurs;
		РегистрКурсыВалют.Записать(Истина);
		
        СсылкаНаСимвольныйКодВалюты = Справочники.Валюты.НайтиПоНаименованию(Элемент.VChCode);
		
		ЕСли Не ЗначениеЗаполнено(СсылкаНаСимвольныйКодВалюты) Тогда
			НовыйЭлемент = Справочники.Валюты.СоздатьЭлемент();
			
			НовыйЭлемент.Наименование = Элемент.VChCode;
			НовыйЭлемент.НаименованиеВалюты = Элемент.Vname;
			НовыйЭлемент.Записать();  
		КонецЕсли;
		
	КонецЦикла;
	
	

	
КонецПроцедуры