Процедура АвтоСумма(СтрокаТабличнойЧасти) Экспорт 
	 СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Цена;
 КонецПроцедуры


&НаСервере
Функция ПолучитьСведенияОВалюте(СимвольныйКодВалюты) Экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КурсыВалютСрезПоследних.КурсВалюты КАК КурсВалюты,
		|	КурсыВалютСрезПоследних.Номинал КАК Номинал
		|ИЗ
		|	РегистрСведений.КурсыВалют.СрезПоследних КАК КурсыВалютСрезПоследних
		|ГДЕ
		|	КурсыВалютСрезПоследних.СимвольныйКодВалюты = &СимвольныйКодВалюты"; 
	
	Запрос.УстановитьПараметр("СимвольныйКодВалюты", СимвольныйКодВалюты);
	
	Результат = Запрос.Выполнить().Выгрузить(); 
	Возврат Результат;
КонецФункции 

&НаСервере
Процедура СохранитьЗначенияРеквизитов(КлючУникальности, СписокНастроек) Экспорт
	ХранилищеОбщихНастроек.Сохранить(КлючУникальности,,СписокНастроек)
КонецПроцедуры 

&НаСервере
Функция ВосстановитьЗначенияРеквизитов(КлючУникальности) Экспорт 
	ЗначенияРеквизитов = ХранилищеОбщихНастроек.Загрузить(КлючУникальности);
	ХранилищеОбщихНастроек.Удалить(КлючУникальности, Неопределено, Неопределено);
	Возврат ЗначенияРеквизитов;
КонецФункции