
Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр ОстаткиНоменклатуры Расход
	Движения.ОстаткиНоменклатуры.Записывать = Истина;
	Для Каждого ТекСтрокаСписокНоменклатуры Из СписокНоменклатуры Цикл
		Движение = Движения.ОстаткиНоменклатуры.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаСписокНоменклатуры.Номенклатура;
		
		Если ТекСтрокаСписокНоменклатуры.Склад.Пустая() Тогда
			Движение.Склад = Склад;
		Иначе
			Движение.Склад = ТекСтрокаСписокНоменклатуры.Склад;
		КонецЕсли;
		
		Движение.Количество = ТекСтрокаСписокНоменклатуры.Количество; 
		
	КонецЦикла;
	
	Движения.Записать(); 
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РасходнаяНакладнаяСписокНоменклатуры.Номенклатура КАК Номенклатура,
	|	СУММА(РасходнаяНакладнаяСписокНоменклатуры.Количество) КАК Количество,
	|	ВЫБОР
	|		КОГДА РасходнаяНакладнаяСписокНоменклатуры.Склад.Ссылка ЕСТЬ NULL
	|				ИЛИ РасходнаяНакладнаяСписокНоменклатуры.Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|			ТОГДА РасходнаяНакладнаяСписокНоменклатуры.Ссылка.Склад
	|		ИНАЧЕ РасходнаяНакладнаяСписокНоменклатуры.Склад
	|	КОНЕЦ КАК Склад
	|ПОМЕСТИТЬ ВременнаяТаблицаРасходнаяНакладная
	|ИЗ
	|	Документ.РасходнаяНакладная.СписокНоменклатуры КАК РасходнаяНакладнаяСписокНоменклатуры
	|ГДЕ
	|	РасходнаяНакладнаяСписокНоменклатуры.Номенклатура.ПодЗаказ = ЛОЖЬ
	|	И РасходнаяНакладнаяСписокНоменклатуры.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	РасходнаяНакладнаяСписокНоменклатуры.Номенклатура,
	|	ВЫБОР
	|		КОГДА РасходнаяНакладнаяСписокНоменклатуры.Склад.Ссылка ЕСТЬ NULL
	|				ИЛИ РасходнаяНакладнаяСписокНоменклатуры.Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|			ТОГДА РасходнаяНакладнаяСписокНоменклатуры.Ссылка.Склад
	|		ИНАЧЕ РасходнаяНакладнаяСписокНоменклатуры.Склад
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиНоменклатурыОстатки.КоличествоОстаток КАК КоличествоОстаток,
	|	ОстаткиНоменклатурыОстатки.Номенклатура КАК Номенклатура,
	|	ОстаткиНоменклатурыОстатки.Склад КАК Склад
	|ИЗ
	|	ВременнаяТаблицаРасходнаяНакладная КАК ВременнаяТаблицаРасходнаяНакладная
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиНоменклатуры.Остатки КАК ОстаткиНоменклатурыОстатки
	|		ПО (ВременнаяТаблицаРасходнаяНакладная.Номенклатура = ОстаткиНоменклатурыОстатки.Номенклатура)
	|ГДЕ
	|	ОстаткиНоменклатурыОстатки.КоличествоОстаток < 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиНоменклатурыОстатки.Номенклатура,
	|	ОстаткиНоменклатурыОстатки.КоличествоОстаток,
	|	ОстаткиНоменклатурыОстатки.Склад";
	
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Не хватает " + Строка(- ВыборкаДетальныеЗаписи.КоличествоОстаток) + " единиц " + Строка(ВыборкаДетальныеЗаписи.Номенклатура) + "!";
		Сообщение.Сообщить(); 
		
		Отказ = Истина;
		
	КонецЦикла;
	
	
	
	
КонецПроцедуры


