
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Проверка = ПроверкаНаНаличиеЗаписей();
	
	Если Проверка Тогда 
		ЗаполнитьТаблицуЗначений();
	Иначе 
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПроверкаНаНаличиеЗаписей()
	
	РезультатЗапроса = ЗагрузитьЗначенияНаСервере();
		
	Если РезультатЗапроса.Количество() <> 0 Тогда 
		Возврат Истина;	
	КонецЕсли; 
	
	Возврат Ложь;
КонецФункции


&НаСервере
Процедура ЗаполнитьТаблицуЗначений()
		
	РезультатЗапроса = ЗагрузитьЗначенияНаСервере();
		
	Для Каждого СтрокаТЗ Из РезультатЗапроса Цикл 
		НоваяСтрока = ЭтаФорма.ТЗРасходнаяНакладная.Добавить();
		
		НоваяСтрока.Документ = СтрокаТЗ.Ссылка;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ЗагрузитьЗначенияНаСервере()

   	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РасходнаяНакладнаяИзменения.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РасходнаяНакладная.Изменения КАК РасходнаяНакладнаяИзменения
	|ГДЕ
	|	РасходнаяНакладнаяИзменения.Ссылка.Ответственный = &Ответственный
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ПриходнаяНакладнаяИзменения.Ссылка
	|ИЗ
	|	Документ.ПриходнаяНакладная.Изменения КАК ПриходнаяНакладнаяИзменения
	|ГДЕ
	|	ПриходнаяНакладнаяИзменения.Ссылка.Ответственный = &Ответственный";
	Запрос.УстановитьПараметр("Ответственный", ПараметрыСеанса.ТекущийПользователь);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат РезультатЗапроса;
	
КонецФункции

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	УдалитьИзмененияНаСервере();
КонецПроцедуры

&НаСервере
Процедура УдалитьИзмененияНаСервере()
	
	Узел = ПланыОбмена.ПланОбменаНакладная.НайтиПоНаименованию("Накладная");

	ТаблицаЗначенийДляУдаления = ЭтаФорма.ТЗРасходнаяНакладная.Выгрузить(, "Документ");
	
	Для Каждого СтрокаТЗ Из ТаблицаЗначенийДляУдаления Цикл 
		ПланыОбмена.УдалитьРегистрациюИзменений(Узел, СтрокаТЗ.Документ);
	КонецЦикла;
		
КонецПроцедуры
