
Процедура РегистрацияИзмененийВРасходнойНакладнойПриЗаписи(Источник, Отказ) Экспорт
	УзелОбмена = ПланыОбмена.ПланОбменаНакладная.НайтиПоНаименованию("Накладная");
	
	Если Источник.Ответственный <> ПараметрыСеанса.ТекущийПользователь Тогда 
		ПланыОбмена.ЗарегистрироватьИзменения(УзелОбмена, Источник);
	КонецЕсли;
КонецПроцедуры


Процедура РегистрацияИзмененийВПриходнойНакладнойПриЗаписи(Источник, Отказ) Экспорт 
	УзелОбмена = ПланыОбмена.ПланОбменаНакладная.НайтиПоНаименованию("Накладная");
	
	Если Источник.Ответственный <> ПараметрыСеанса.ТекущийПользователь Тогда
		ПланыОбмена.ЗарегистрироватьИзменения(УзелОбмена, Источник);
	КонецЕсли;
КонецПроцедуры





