
&НаКлиенте
Процедура Подобрать(Команда)
	ЗагрузитьЗначенияНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьЗначенияНаСервере()
	
	Объект.РасходныеНакладные.Очистить();
	
	Запрос = Новый Запрос;
	//Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходнаяНакладная.Ссылка КАК Ссылка,
		|	РасходнаяНакладная.СуммаПоДокументу КАК СуммаПоДокументу
		|ИЗ
		|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
		|ГДЕ
		|	РасходнаяНакладная.Дата >= &НачалоПериода
		|	И РасходнаяНакладная.Дата <= &КонецПериода";
	
	Если ЗначениеЗаполнено(Объект.НачалоПериода) Тогда 
		Запрос.УстановитьПараметр("НачалоПериода", Объект.НачалоПериода);
	Иначе
		Сообщить("Выбрана текущая дата в качестве начала периода");
		Запрос.УстановитьПараметр("НачалоПериода", ТекущаяДата());
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.КонецПериода) Тогда 
		Запрос.УстановитьПараметр("КонецПериода", Объект.КонецПериода);
	Иначе
		Сообщить("Выбрана текущая дата в качестве конца периода");
		Запрос.УстановитьПараметр("КонецПериода", ТекущаяДата());
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		НоваяСтрока = Объект.РасходныеНакладные.Добавить();
		НоваяСтрока.РасходнаяНакладная = ВыборкаДетальныеЗаписи.Ссылка;
		НоваяСтрока.Сумма = ВыборкаДетальныеЗаписи.СуммаПоДокументу;
	КонецЦикла;
						
КонецПроцедуры