&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	СохранитьЗначенияРеквизитовФормы();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВосстановитьЗначенияРеквизитовФормы();
КонецПроцедуры


#Область РаботаСРеквизитамиФормы

&НаСервере
Процедура СохранитьЗначенияРеквизитовФормы()
	Если Не Объект.Ссылка.Пустая() Тогда
		Настройки = Новый Соответствие;
		Настройки.Вставить("ДополнительнаяИнформация", ДополнительнаяИнформация);
		
		СерверныеПроцедуры.СохранитьЗначенияРеквизитов(Объект.Ссылка, Настройки);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ВосстановитьЗначенияРеквизитовФормы()
	ЗначенияРеквизитов = СерверныеПроцедуры.ВосстановитьЗначенияРеквизитов(Объект.Ссылка);
	
	Если ТипЗнч(ЗначенияРеквизитов) = Тип("Соответствие") Тогда
		ДополнительнаяИнформация = ЗначенияРеквизитов.Получить("ДополнительнаяИнформация");	
	КонецЕсли;
КонецПроцедуры


#КонецОбласти