
&НаКлиенте
Процедура ПоказатьВопросПриВыборе(ПараметрЗаписи, Закрывать)   
	Если Объект.ОсновнойДокумент Тогда	
		
		Договор = ЗагрузитьЗначенияНаСервере(Объект.Владелец);
		
		Если Договор <> Null Тогда
			
			Отказ = Истина;
			
			ПараметрыЗаписи = Новый Структура();
			
			ПараметрыЗаписи.Вставить("Запись", ПараметрЗаписи);
			ПараметрыЗаписи.Вставить("Договор", Договор);

						
			ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗаписьюЗавершение", ЭтотОбъект, ПараметрыЗаписи),
			"Договор """ + Договор + """ уже является основным для контрагента. Перезаписать?", 
			РежимДиалогаВопрос.ДаНет);
			
		ИначеЕсли Закрывать Тогда
			 
			ЭтаФорма.Записать();
			ЭтаФорма.Закрыть();
			
		ИначеЕсли Не Закрывать Тогда
			
			ЭтаФорма.Записать();
			
		КонецЕсли;  
		
	КонецЕсли;
	
	Если Не Объект.ОсновнойДокумент Тогда 
		Если Закрывать Тогда 
			ЭтаФорма.Записать();
			ЭтаФорма.Закрыть();
		ИначеЕсли Не Закрывать Тогда 
			ЭтаФорма.Записать();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПередЗаписьюЗавершение(РезультатВопроса, ПараметрыЗаписи) Экспорт; 		
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		
		ИзменитьОсновнойДокумент(ПараметрыЗаписи.Договор);	
		
		Если ПараметрыЗаписи.Запись Тогда				
			ЭтаФорма.Записать();
		КонецЕсли;
			
		Если Не ПараметрыЗаписи.Запись Тогда 			
			ЭтаФорма.Записать();
			ЭтаФорма.Закрыть(); 				
		КонецЕсли;

	КонецЕсли;  
	
	
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда 
		Объект.ОсновнойДокумент = Ложь;
		//ЭтаФорма.Записать();
	КонецЕсли;
		
КонецПроцедуры



&НаСервере
Функция  ЗагрузитьЗначенияНаСервере(Владелец)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Договоры.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Договоры КАК Договоры
	|ГДЕ
	|	Договоры.Владелец = &Владелец
	|	И Договоры.ОсновнойДокумент = ИСТИНА
	|	И Договоры.Ссылка <> &ОбъектСсылка";
	
	Запрос.УстановитьПараметр("Владелец", Владелец); 
	Запрос.УстановитьПараметр("ОбъектСсылка", Объект.Ссылка);  
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат Null;
	
КонецФункции


&НаСервере
Процедура ИзменитьОсновнойДокумент(Ссылка)	
	Договор = Ссылка.ПолучитьОбъект();
	Договор.ОсновнойДокумент = Ложь;
	Договор.Записать();
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	Запись = Ложь;
	Закрывать = Истина;
	ПоказатьВопросПриВыборе(Запись, Закрывать);
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьВСправочник(Команда)
	Запись = Истина;
	Закрывать = Ложь;
	ПоказатьВопросПриВыборе(Запись, Закрывать);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	СохранитьЗначенияРеквизитовФормы();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВосстановитьЗначенияРеквизитовФормы();
КонецПроцедуры


#Область РаботаСРеквизитамиФормы

&НаСервере
Процедура СохранитьЗначенияРеквизитовФормы()
	Если Не Объект.Ссылка.Пустая() Тогда
		Настройки = Новый Соответствие;
		Настройки.Вставить("ДополнительнаяИнформация", ДополнительнаяИнформация);
		
		СерверныеПроцедуры.СохранитьЗначенияРеквизитов(Объект.Ссылка, Настройки);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ВосстановитьЗначенияРеквизитовФормы()
	ЗначенияРеквизитов = СерверныеПроцедуры.ВосстановитьЗначенияРеквизитов(Объект.Ссылка);
	
	Если ТипЗнч(ЗначенияРеквизитов) = Тип("Соответствие") Тогда
		ДополнительнаяИнформация = ЗначенияРеквизитов.Получить("ДополнительнаяИнформация");	
	КонецЕсли;
КонецПроцедуры



#КонецОбласти

&НаКлиенте
Процедура ПечатьWord(Команда)
	ПечатьWordНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПечатьWordНаСервере() 
	Если Не Объект.Ссылка.Пустая() Тогда
		Макет = Справочники.Договоры.ПолучитьМакет("МакетWord");
		Справочники.Договоры.ПечатьWord(Макет, Объект.Ссылка);    
	КонецЕсли;
КонецПроцедуры

