
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВосстановитьЗначенияРеквизитовФормы();
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	НоваяЗапись = РегистрыСведений.СведенияОСотрудниках.СоздатьМенеджерЗаписи();
	
	НоваяЗапись.Период = ТекущаяДата();
	НоваяЗапись.Сотрудник = Объект.Ссылка;
	НоваяЗапись.Подразделение = ТекущееПодразделение;
	НоваяЗапись.Оклад = ТекущаяТарифнаяСтавка; 
	НоваяЗапись.Записать(Ложь);
КонецПроцедуры


&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	СохранитьЗначенияРеквизитовФормы();
КонецПроцедуры


#Область РаботаСРеквизитамиФормы

&НаСервере
Процедура СохранитьЗначенияРеквизитовФормы()
	Если Не Объект.Ссылка.Пустая() Тогда
		Настройки = Новый Соответствие;
		Настройки.Вставить("ДатаПриема", ДатаПриема);
		Настройки.Вставить("ДатаУвольнения", ДатаУвольнения);
		Настройки.Вставить("ТекущееПодразделение", ТекущееПодразделение);
		Настройки.Вставить("ТекущаяДолжность", ТекущаяДолжность);
		Настройки.Вставить("ТекущийВидЗанятости", ТекущийВидЗанятости);
		Настройки.Вставить("ТекущаяТарифнаяСтавка", ТекущаяТарифнаяСтавка);
		
		СерверныеПроцедуры.СохранитьЗначенияРеквизитов(Объект.Ссылка, Настройки);  
	КонецЕсли;
КонецПроцедуры 


&НаСервере
Процедура ВосстановитьЗначенияРеквизитовФормы()  
	ЗначениеРеквизитов = СерверныеПроцедуры.ВосстановитьЗначенияРеквизитов(Объект.Ссылка);
	
	Если ТипЗнч(ЗначениеРеквизитов) = Тип("Соответствие") Тогда
		ДатаПриема = ЗначениеРеквизитов.Получить("ДатаПриема");
		ДатаУвольнения = ЗначениеРеквизитов.Получить("ДатаУвольнения");
		ТекущееПодразделение = ЗначениеРеквизитов.Получить("ТекущееПодразделение");
		ТекущаяДолжность = ЗначениеРеквизитов.Получить("ТекущаяДолжность");
		ТекущийВидЗанятости = ЗначениеРеквизитов.Получить("ТекущийВидЗанятости");
		ТекущаяТарифнаяСтавка = ЗначениеРеквизитов.Получить("ТекущаяТарифнаяСтавка");
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти 

&НаКлиенте
Процедура ФизическоеЛицоПриИзменении(Элемент)
	Объект.Наименование = Элемент.ВыделенныйТекст;
КонецПроцедуры


&НаКлиенте
Процедура НадписьИсторияФИОНажатие(Элемент)
	Отбор = Новый Структура("ФизическоеЛицо", Объект.ФизическоеЛицо);
	ОткрытьФорму("РегистрСведений.ФИОФизическихЛиц.ФормаСписка", Новый Структура("Отбор", Отбор)); 
КонецПроцедуры
